blog/20210101.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-25 Tue 00:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>New Year, New Website</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Hartigan" />
<link rel="preconnect" href="https://fonts.gstatic.com">
<link href="https://fonts.googleapis.com/css2?family=Ubuntu+Mono&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
<link rel="icon" type="image/png" href="../ref/favicon.png" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">New Year, New Website</h1>

<div id="outline-container-orgabda2a8" class="outline-2">
<h2 id="orgabda2a8">January 1st, 2021</h2>
<div class="outline-text-2" id="text-orgabda2a8">
<p>
2020 was definitely a year for the history books: socially, politically, racially, environmentally, you name it.  But now's not the time for a retrospective &#x2013; all the issues of 2020 will still pursue us well into the new year and beyond. Rather, this post will be focusing on the insular world of my winter break before my last semester of college. Going in, I made several goals:
</p>

<ul class="org-ul">
<li>Complete my graduate school applications</li>
<li>Email all the professors at said schools to express interest in their labs</li>
<li>Set up my personal website</li>
<li>Run more (at least 5 days a week)</li>
<li>Complete a few more personal projects</li>
</ul>

<p>
My last semester was plagued by graduate applications: letters of recommendation, essays, the GRE, etc. However, today I finally submitted my application to the University of Illinois and thus completed that stage of the process. As of today I've emailed all the professors I am interested in working with (save the ones from U of I) and the responses are starting to trickle in. I've been running more the past couple weeks as well, generally 5 days a week at an average of 5 miles a day. Progress has also been made on LiveTex, a snappy little LaTeX viewing web app I want to make to remove the wasted time of rendering full LaTeX documents. This comes at the cost of full functionality, but the intent is only to make neat equations with it. Regardless, this post isn't about LaTeX, my running habits, or my post-baccalaureate plans.
</p>

<p>
The last goal I have yet to review is creating my personal website. I credit my friend <a href="https://starmaid.github.io/">Nick Masso</a> for spurring me to make my own website after seeing theirs and learning about Github's free hosting service through <a href="https://pages.github.com/">Github Pages</a>. The official guide suggests using Jekyll, a markdown-to-HTML compiler to create your site, but I have an inane fascination for making things harder for myself. Spurred by my ambiguous desire to "use emacs more", I decided to use emac's org-mode to create this site. Org, in addition to markdown capabilities and an absurd amount of other features, has the ability to publish *.org files to static HTML pages. I followed <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">this guide</a> to create a project and publish it; I've also been writing my own CSS.
</p>

<p>
During the course of  making <a href="https://bitwise-a3c2d.web.app/">Bitwise</a>, we gave very little consideration to the raw CSS that went into the site. Through the use of libraries such as React.js and Semantic UI, the CSS was abstracted away from us. This was for the best, since it would've been fiendishly complex to write and frankly, we didn't have the time. However, now that I'm writing my own static site where the DOM's most complicated element is a list, writing the CSS has been relaxed and rewarding. Really makes me feel like I'm in the early 2000s.
</p>

<p>
From the first inception of this website, it's been a given that it'll be white monospace font on a black background. I toyed with the idea of using a starry night sky as the background, but the realistic shots didn't fit somehow. It was at this point I remembered a conversation with <a href="https://nickymarino.com/">Nicky Marino</a>, a friend and programmer discussing his project <a href="https://github.com/nickymarino/virgo">Virgo</a> a year or so ago. Virgo is a Ruby CLI he wrote to generate starry backgrounds reminiscent of the Virgo A galaxy. With his permission, I used this to generate the site background you see now.
</p>

<p>
Overall, I've had a fun few days learning org-mode and CSS more, as well as customizing my own brand. I think the site turned out very well and I'm pleased with its current state. Expect more updates as my life progresses and I complete projects though &#x2013; maybe I'll add an RSS feed or something. For now, I'll turn my attention to the few other projects I have set aside before I resume school on January 19th.
</p>

<p>
Sent from my iPhone
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Hartigan (<a href="mailto:m.hartigan.c@gmail.com">m.hartigan.c@gmail.com</a>)</p>
<p class="modified">Last Modified: 2021-05-25 Tue 00:12</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
<p class="credit">Background created using <a href="https://github.com/nickymarino/virgo">Virgo</a></p>
</div>
</body>
</html>
